soap-query-examples/UpdateDocIndexes_ModifyIndexes.xml

<soapenv:Envelope xmlns:cyp="http://asg.com/cypress_wcfsvc_v73/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header/>
	<soapenv:Body>
		<cyp:UpdateDocIndexes>
			<!--Optional:-->
			<cyp:UserCredential>
				<cyp:CredentialType>UserIdPassword</cyp:CredentialType>
				<cyp:DomainName>molitor</cyp:DomainName>
				<cyp:UserName>srv_bdoc</cyp:UserName>
				<cyp:Password>28awuS+eBrEm</cyp:Password>
				<cyp:CypWsUserId/>
				<cyp:CredentialData/>
			</cyp:UserCredential>
			<!--Optional:-->
			<cyp:ReqUpdtDocInx>
				<cyp:TaskId>ModifyIndexes</cyp:TaskId>
				<!--Optional:-->
				<cyp:UpdtTask xsi:type="cyp:CwsMdfyInxTask">
					<cyp:UseTempToCvtVals>false</cyp:UseTempToCvtVals>
					<!--IS A CwsAddDocInxActn :-->
					<cyp:MdfyInxActns xsi:type="cyp:CwsMdfyDocInxActns">
						<cyp:MdfyInxActn xsi:type="cyp:CwsMdfyInxActn">
							<cyp:UpdtScope>DocLevelUpdate
							</cyp:UpdtScope>
							<cyp:TargetDocs>
								<cyp:DdocIds>21562</cyp:DdocIds>
							</cyp:TargetDocs>
							<cyp:MdfyInxVals xsi:type="cyp:CwsMdfyInxVals">
								<cyp:MdfyInxVal xsi:type="cyp:CwsMdfyInxVal">
									<cyp:InxId>1026</cyp:InxId>
									<cyp:CurVal xsi:type="xsd:string">OUT</cyp:CurVal>
									<cyp:NewVal xsi:type="xsd:string">TOTO</cyp:NewVal>
									<cyp:Template/>
								</cyp:MdfyInxVal>
							</cyp:MdfyInxVals>
						</cyp:MdfyInxActn>
					</cyp:MdfyInxActns>
				</cyp:UpdtTask>
			</cyp:ReqUpdtDocInx>
			<!--Optional:-->
			<cyp:ReqOptUpdtDocInx/>
		</cyp:UpdateDocIndexes>
	</soapenv:Body>
</soapenv:Envelope>